
Shader "浅墨Shader编程/Volume4/15.基本Alpha测试" 
{
	//-------------------------------【属性】-----------------------------------------
    Properties 
	{
       _MainTex ("基础纹理 (RGB)-透明度(A)", 2D) = "white" {}
    }

	//--------------------------------【子着色器】--------------------------------
    SubShader 
	{
		//----------------------------【通道】-------------------------------
		//		说明：进行Alpha测试操作，且只渲染透明度大于60%的像素
		//----------------------------------------------------------------------
        Pass 
		{
			// 只渲染透明度大于60%的像素
            AlphaTest Greater 0.6
            SetTexture [_MainTex] { combine texture }
        }
    }
}
